#  Welcome to Pandas Tutorial

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 =  {
    "name":['harry','rohan','skillf'],
    "marks": [51,42,32],
    "city":['rampur','kolkata','brailly'] 
}

In [4]:
df= pd.DataFrame(dict1)  #making dataframe from dictionary

In [5]:
df.to_csv("frdns.csv",index=False) #writing to csv

In [6]:
df.head(2)

    name  marks     city
0  harry     51   rampur
1  rohan     42  kolkata

In [7]:
df.tail(1)

     name  marks     city
2  skillf     32  brailly

In [8]:
df.describe() #describe all mathematical data

           marks
count   3.000000
mean   41.666667
std     9.504385
min    32.000000
25%    37.000000
50%    42.000000
75%    46.500000
max    51.000000

In [9]:
file = pd.read_csv('frdns.csv')
file

     name  marks     city
0   harry     51   rampur
1   rohan     42  kolkata
2  skillf     32  brailly

In [14]:
file['marks'][0] = 120
file

C:\Users\Administrator\AppData\Local\Temp\ipykernel_19124\1569864261.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file['marks'][0] = 120

     name  marks     city
0   harry    120   rampur
1   rohan     42  kolkata
2  skillf     32  brailly

In [16]:
file.index = ['1st','2nd','3rd']
file

       name  marks     city
1st   harry    120   rampur
2nd   rohan     42  kolkata
3rd  skillf     32  brailly

In [19]:
ser = pd.Series(np.arange(27,55,2))  # making a series
ser.head(3)

0    27
1    29
2    31
dtype: int32

### adding series together

In [20]:

ser1 = pd.Series(np.arange(27, 55, 2))
ser2 = pd.Series(np.arange(100, 128, 2))
dataframe = pd.DataFrame({'Column1': ser1, 'Column2': ser2})
dataframe # adding multiple series to make a dataset

    Column1  Column2
0        27      100
1        29      102
2        31      104
3        33      106
4        35      108
5        37      110
6        39      112
7        41      114
8        43      116
9        45      118
10       47      120
11       49      122
12       51      124
13       53      126

### adding new series in dataframe

In [21]:
data = {
    'Column1': [1, 2, 3],
    'Column2': [4, 5, 6]
}
dataframe = pd.DataFrame(data)

new_series = pd.Series([7, 8, 9])

dataframe['NewColumn'] = new_series
dataframe

   Column1  Column2  NewColumn
0        1        4          7
1        2        5          8
2        3        6          9

#### using pd.concat

In [23]:
data = {
    'Column1': [1, 2, 3],
    'Column2': [4, 5, 6]
}
df = pd.DataFrame(data)

new_series = pd.Series([7, 8, 9])

dataframe = pd.concat([df, new_series], axis=1)

dataframe.columns = ['Column1', 'Column2', 'NewColumn']
dataframe

   Column1  Column2  NewColumn
0        1        4          7
1        2        5          8
2        3        6          9